/*
	10. Дана последовательность температурных колебаний: -25.4, -27.0 13.0, 19.0,
	15.5, 24.5, -21.0, 32.5. Объединить данные значения в группы с шагом в 10
	градусов. Последовательность в подмножноствах не важна.
	Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc.
*/
package main

import (
	"fmt"
	"math"
)

func main() {
	T := []float64{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5, -5., 7.}
	m := make(map[float64][]float64)
	for _, t := range T {
		g := math.Floor(t/10) * 10
		m[g] = append(m[g], t)
	}
	fmt.Println(m)
}

/*
map[-30:[-25.4 -27 -21] -10:[-5] 0:[7] 10:[13 19 15.5] 20:[24.5] 30:[32.5]]
Пришлось сделать программу немного неправильно, т.к. если выполнять условия, получится непрерывный интервал в районе 0
размером 20 град (значения -5 и 7 попадут в интервал 0 условно
*/
