/*
	2. Написать программу, которая конкурентно рассчитает значение квадратов чисел
	взятых из массива (2,4,6,8,10) и выведет их квадраты в stdout.
*/

package main

import (
	"fmt"
	"time"
)

func main() {
	A := [5]int{2, 4, 6, 8, 10} // Объявляем массив

	for _, v := range A {
		// запускаем отдельную горутину для каждого вычисления
		go func(n int) {
			fmt.Println(n * n) // вывод будет в случайном порядке, по условию не запрещается
		}(v) // передаем через параметр, чтобы каждая горутина получила свое значение
	}
	time.Sleep(time.Second) // с waitgroup не заморачиваемся в учебных целях
}
