/*
	Дана последовательность чисел: 2,4,6,8,10. Найти сумму их
	квадратов(2	2+3	2+4	2….) с использованием конкурентных вычислений
*/
package main

import (
	"fmt"
	"sync/atomic"
	"time"
)

func main() {
	A := [5]int32{2, 4, 6, 8, 10} // Объявляем массив
	var sum int32

	for _, v := range A {
		// запускаем отдельную горутину для каждого вычисления
		go func(n int32) {
			atomic.AddInt32(&sum, n*n) // atomic чтобы исключить гонки
		}(v) // передаем через параметр, чтобы каждая горутина получила свое значение
	}
	time.Sleep(time.Second) // с waitgroup не заморачиваемся в учебных целях
	fmt.Println(sum)        // Выводим
}
